In [154]:
import pandas as pd

# Series

In [155]:
dt = [1, 2, 3, 4, 5]

In [156]:
s = pd.Series(dt)

In [157]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [158]:
idx = ["Linha" + str(i+1) for i in range(5)]

In [159]:
s = pd.Series(data = dt, index = idx)

In [160]:
s

Linha1    1
Linha2    2
Linha3    3
Linha4    4
Linha5    5
dtype: int64

In [161]:
data = {"Linha" + str(i+1): i+1 for i in range(5)}
s = pd.Series(data)
s

Linha1    1
Linha2    2
Linha3    3
Linha4    4
Linha5    5
dtype: int64

In [162]:
s1 = s + 2
s1

Linha1    3
Linha2    4
Linha3    5
Linha4    6
Linha5    7
dtype: int64

In [163]:
s2 = s1 * s
s2

Linha1     3
Linha2     8
Linha3    15
Linha4    24
Linha5    35
dtype: int64

# DataFrame

In [164]:
data1 = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]
data1

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [165]:
df1 = pd.DataFrame(data1)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [166]:
idx = ["Linha" + str(i) for i in range(3)]
clms = ["Coluna" + str(i) for i in range(3)]

In [167]:
df1 = pd.DataFrame(data = data1, index = idx, columns = clms)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [168]:
data2 = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
data2

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [169]:
df2 = pd.DataFrame(data2)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [170]:
data3 = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]
data3

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [171]:
df3 = pd.DataFrame(data = data3, index = idx, columns = clms)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [172]:
df1[df1 > 0] = "A"
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [173]:
df2[df2 > 0] = "B"
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [174]:
df3[df3 > 0] = "C"
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [175]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [176]:
df5 = pd.concat([df1, df2, df3], axis = 1)
df5

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C